app/controllers/docs_controller.rb

    def index
        @docs = Doc.where(user_id: current_user)
---
SELECT "docs".* FROM "docs" WHERE "docs"."user_id" = ?  [["user_id", 1]]

    def create
        @doc = current_user.docs.build(doc_params)

        if @doc.save
---
INSERT INTO "docs" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "another"], ["content", "hello again"], ["created_at", "2019-11-20 19:53:50.068131"], ["updated_at", "2019-11-20 19:53:50.068131"], ["user_id", 1]]

    def find_doc
        @doc = Doc.find(params[:id])
---
SELECT  "docs".* FROM "docs" WHERE "docs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]